{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: codenamize in /opt/conda/lib/python3.6/site-packages (1.2.3)\n",
      "Requirement already satisfied: six in /opt/conda/lib/python3.6/site-packages (from codenamize) (1.11.0)\n",
      "Requirement already satisfied: wheel in /opt/conda/lib/python3.6/site-packages (from codenamize) (0.31.1)\n",
      "Requirement already satisfied: py2neo in /opt/conda/lib/python3.6/site-packages (4.1.0)\n",
      "Requirement already satisfied: ipykernel in /opt/conda/lib/python3.6/site-packages (from py2neo) (4.8.2)\n",
      "Requirement already satisfied: traitlets>=4.1.0 in /opt/conda/lib/python3.6/site-packages (from py2neo) (4.3.2)\n",
      "Requirement already satisfied: urllib3[secure]<1.23,>=1.21.1 in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.22)\n",
      "Requirement already satisfied: prompt-toolkit==1.0.15 in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.0.15)\n",
      "Requirement already satisfied: neotime in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.7.2)\n",
      "Requirement already satisfied: neo4j-driver<1.7,>=1.6 in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.6.2)\n",
      "Requirement already satisfied: pytest in /opt/conda/lib/python3.6/site-packages (from py2neo) (4.0.0)\n",
      "Requirement already satisfied: jupyter-client in /opt/conda/lib/python3.6/site-packages (from py2neo) (5.2.3)\n",
      "Requirement already satisfied: click>=2.0 in /opt/conda/lib/python3.6/site-packages (from py2neo) (7.0)\n",
      "Requirement already satisfied: colorama in /opt/conda/lib/python3.6/site-packages (from py2neo) (0.4.0)\n",
      "Requirement already satisfied: pygments>=2.0 in /opt/conda/lib/python3.6/site-packages (from py2neo) (2.2.0)\n",
      "Requirement already satisfied: jupyter-console in /opt/conda/lib/python3.6/site-packages (from py2neo) (5.2.0)\n",
      "Requirement already satisfied: tornado>=4.0 in /opt/conda/lib/python3.6/site-packages (from ipykernel->py2neo) (5.1)\n",
      "Requirement already satisfied: ipython>=4.0.0 in /opt/conda/lib/python3.6/site-packages (from ipykernel->py2neo) (6.5.0)\n",
      "Requirement already satisfied: six in /opt/conda/lib/python3.6/site-packages (from traitlets>=4.1.0->py2neo) (1.11.0)\n",
      "Requirement already satisfied: decorator in /opt/conda/lib/python3.6/site-packages (from traitlets>=4.1.0->py2neo) (4.3.0)\n",
      "Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.6/site-packages (from traitlets>=4.1.0->py2neo) (0.2.0)\n",
      "Requirement already satisfied: certifi; extra == \"secure\" in /opt/conda/lib/python3.6/site-packages (from urllib3[secure]<1.23,>=1.21.1->py2neo) (2018.8.24)\n",
      "Requirement already satisfied: wcwidth in /opt/conda/lib/python3.6/site-packages (from prompt-toolkit==1.0.15->py2neo) (0.1.7)\n",
      "Requirement already satisfied: pytz in /opt/conda/lib/python3.6/site-packages (from neotime->py2neo) (2018.5)\n",
      "Requirement already satisfied: more-itertools>=4.0.0 in /opt/conda/lib/python3.6/site-packages (from pytest->py2neo) (4.3.0)\n",
      "Requirement already satisfied: atomicwrites>=1.0 in /opt/conda/lib/python3.6/site-packages (from pytest->py2neo) (1.2.1)\n",
      "Requirement already satisfied: pluggy>=0.7 in /opt/conda/lib/python3.6/site-packages (from pytest->py2neo) (0.8.0)\n",
      "Requirement already satisfied: attrs>=17.4.0 in /opt/conda/lib/python3.6/site-packages (from pytest->py2neo) (18.1.0)\n",
      "Requirement already satisfied: setuptools in /opt/conda/lib/python3.6/site-packages (from pytest->py2neo) (40.0.0)\n",
      "Requirement already satisfied: py>=1.5.0 in /opt/conda/lib/python3.6/site-packages (from pytest->py2neo) (1.7.0)\n",
      "Requirement already satisfied: jupyter_core in /opt/conda/lib/python3.6/site-packages (from jupyter-client->py2neo) (4.4.0)\n",
      "Requirement already satisfied: pyzmq>=13 in /opt/conda/lib/python3.6/site-packages (from jupyter-client->py2neo) (17.0.0)\n",
      "Requirement already satisfied: python-dateutil>=2.1 in /opt/conda/lib/python3.6/site-packages (from jupyter-client->py2neo) (2.7.3)\n",
      "Requirement already satisfied: backcall in /opt/conda/lib/python3.6/site-packages (from ipython>=4.0.0->ipykernel->py2neo) (0.1.0)\n",
      "Requirement already satisfied: jedi>=0.10 in /opt/conda/lib/python3.6/site-packages (from ipython>=4.0.0->ipykernel->py2neo) (0.12.1)\n",
      "Requirement already satisfied: pexpect; sys_platform != \"win32\" in /opt/conda/lib/python3.6/site-packages (from ipython>=4.0.0->ipykernel->py2neo) (4.6.0)\n",
      "Requirement already satisfied: pickleshare in /opt/conda/lib/python3.6/site-packages (from ipython>=4.0.0->ipykernel->py2neo) (0.7.4)\n",
      "Requirement already satisfied: simplegeneric>0.8 in /opt/conda/lib/python3.6/site-packages (from ipython>=4.0.0->ipykernel->py2neo) (0.8.1)\n",
      "Requirement already satisfied: parso>=0.3.0 in /opt/conda/lib/python3.6/site-packages (from jedi>=0.10->ipython>=4.0.0->ipykernel->py2neo) (0.3.1)\n",
      "Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.6/site-packages (from pexpect; sys_platform != \"win32\"->ipython>=4.0.0->ipykernel->py2neo) (0.6.0)\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "!{sys.executable} -m pip install codenamize ;\n",
    "!{sys.executable} -m pip install py2neo ;"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Requête REST\n",
    "\n",
    "Il faut utiliser l'API transactionnelle\n",
    "\n",
    "Les requêtes devront comporter les headers suivant: \n",
    "```\n",
    "accept: application/json\n",
    "content-type: application/json\n",
    "authorization: Basic bmVvNGo6cG9pbnRlcnMtY3JhbXBzLXJha2U=\n",
    "x-stream: true\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Requête pour obtenir 1 noeud\n",
    "\n",
    "```json\n",
    "POST /db/data/transaction/commit\n",
    "\n",
    "{\n",
    "  \"statements\": [\n",
    "    {\n",
    "      \"statement\": \"MATCH (n) RETURN n LIMIT 1\"\n",
    "    }\n",
    "  ]\n",
    "}\n",
    "```\n",
    "\n",
    "Réponse:\n",
    "\n",
    "```json\n",
    "{\n",
    "  \"results\": [\n",
    "    {\n",
    "      \"columns\": [\n",
    "        \"n\"\n",
    "      ],\n",
    "      \"data\": [\n",
    "        {\n",
    "          \"row\": [\n",
    "            {\n",
    "              \"code\": \"REQ-RS-011\",\n",
    "              \"nature\": \"RS\",\n",
    "              \"name\": \"knowing-morning\"\n",
    "            }\n",
    "          ],\n",
    "          \"meta\": [\n",
    "            {\n",
    "              \"id\": 0,\n",
    "              \"type\": \"node\",\n",
    "              \"deleted\": false\n",
    "            }\n",
    "          ]\n",
    "        }\n",
    "      ]\n",
    "    }\n",
    "  ],\n",
    "  \"errors\": []\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Pour avoir le graph, il faut ajouter `\"resultDataContents\" : [ \"graph\" ]`\n",
    "\n",
    "```json\n",
    "{\n",
    "  \"statements\": [\n",
    "    {\n",
    "      \"statement\": \"MATCH path=(n)-[r]-(p) RETURN n, r, p LIMIT 1\",\n",
    "      \"resultDataContents\" : [ \"graph\" ]\n",
    "    }\n",
    "  ]\n",
    "}\n",
    "```\n",
    "__Résultats__\n",
    "\n",
    "```json\n",
    "{\n",
    "   \"results\":[\n",
    "      {\n",
    "         \"columns\":[\n",
    "            \"n\",\n",
    "            \"r\",\n",
    "            \"p\"\n",
    "         ],\n",
    "         \"data\":[\n",
    "            {\n",
    "               \"graph\":{\n",
    "                  \"nodes\":[\n",
    "                     {\n",
    "                        \"id\":\"0\",\n",
    "                        \"labels\":[\n",
    "                           \"Requirement\",\n",
    "                           \"RequirementRS\"\n",
    "                        ],\n",
    "                        \"properties\":{\n",
    "                           \"code\":\"REQ-RS-011\",\n",
    "                           \"nature\":\"RS\",\n",
    "                           \"name\":\"knowing-morning\"\n",
    "                        }\n",
    "                     },\n",
    "                     {\n",
    "                        \"id\":\"132\",\n",
    "                        \"labels\":[\n",
    "                           \"Requirement\",\n",
    "                           \"RequirementSDR\"\n",
    "                        ],\n",
    "                        \"properties\":{\n",
    "                           \"code\":\"REQ-SDR-017\",\n",
    "                           \"nature\":\"SDR\",\n",
    "                           \"name\":\"crazy-attack\"\n",
    "                        }\n",
    "                     }\n",
    "                  ],\n",
    "                  \"relationships\":[\n",
    "                     {\n",
    "                        \"id\":\"45\",\n",
    "                        \"type\":\"HOW\",\n",
    "                        \"startNode\":\"0\",\n",
    "                        \"endNode\":\"132\",\n",
    "                        \"properties\":{\n",
    "\n",
    "                        }\n",
    "                     }\n",
    "                  ]\n",
    "               }\n",
    "            }\n",
    "         ]\n",
    "      }\n",
    "   ],\n",
    "   \"errors\":[\n",
    "\n",
    "   ]\n",
    "}\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph, Relationship\n",
    "from scripts import vis\n",
    "\n",
    "\n",
    "graph = Graph('http://34.227.93.73:34593', auth=('neo4j','pointers-cramps-rake'))\n",
    "\n",
    "def draw_result(name, subg):\n",
    "    nodes = []\n",
    "    edges = []\n",
    "    for n in subg.nodes:\n",
    "        nodes.append( {'id': n['code'], 'label': n['code'], 'group': list(n.labels)[0] })\n",
    "\n",
    "    for n in subg.relationships:\n",
    "        edges.append({'from': n.start_node['code'], 'to': n.end_node['code']})\n",
    "        \n",
    "    return vis.vis_network(name,nodes, edges,True)\n",
    "\n",
    "def draw_query(name, query):\n",
    "    subg = graph.run(query).to_subgraph()\n",
    "    return draw_result(name, subg)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"800\"\n",
       "            src=\"figure/graph-example.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f617355dba8>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "draw_query('example', 'MATCH path=(n)-[r:HOW]-(p) RETURN n, r, p LIMIT 50')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"800\"\n",
       "            src=\"figure/graph-example.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f61734b2fd0>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "draw_query('example', 'MATCH (n)-[r:HOW]->(p) RETURN n, r, p LIMIT 200')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
